# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users = pd.read_csv(url, sep='|', index_col='user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [3]:
users.groupby('occupation')['age'].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [8]:
gender_mapper = {'M': 1, 'F': 0}
users['gender_n'] = users['gender'].map(gender_mapper)
users

         age gender     occupation zip_code  gender_n
user_id
1         24      M     technician    85711         1
2         53      F          other    94043         0
3         23      M         writer    32067         1
4         24      M     technician    43537         1
5         33      F          other    15213         0
...      ...    ...            ...      ...       ...
939       26      F        student    33319         0
940       32      M  administrator    02215         1
941       20      M        student    97229         1
942       48      F      librarian    78209         0
943       22      M        student    77841         1

[943 rows x 5 columns]

In [11]:
a = users.groupby('occupation')['gender_n'].sum() / users['occupation'].value_counts() * 100
a.sort_values(ascending = False)

doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64

In [12]:
users.groupby(['occupation', 'gender']).count().groupby('occupation').apply(lambda x: x.iloc[0]/(x.iloc[0] + x.iloc[1]) if len(x) > 1 else x.iloc[0]/x.iloc[0])['age'].rename('freq').sort_values(ascending=False)*100

occupation
doctor           100.000000
homemaker         85.714286
healthcare        68.750000
librarian         56.862745
artist            46.428571
administrator     45.569620
none              44.444444
writer            42.222222
marketing         38.461538
other             34.285714
student           30.612245
educator          27.368421
salesman          25.000000
lawyer            16.666667
entertainment     11.111111
scientist          9.677419
executive          9.375000
programmer         9.090909
retired            7.142857
technician         3.703704
engineer           2.985075
Name: freq, dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

In [5]:
users.groupby('occupation')['age'].agg(['min', 'max'])

               min  max
occupation
administrator   21   70
artist          19   48
doctor          28   64
educator        23   63
engineer        22   70
entertainment   15   50
executive       22   69
healthcare      22   62
homemaker       20   50
lawyer          21   53
librarian       23   69
marketing       24   55
none            11   55
other           13   64
programmer      20   63
retired         51   73
salesman        18   66
scientist       23   55
student          7   42
technician      21   55
writer          18   60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [13]:
users.groupby(['occupation', 'gender'])['age'].mean().apply(lambda x: round(x))

occupation     gender
administrator  F         41
               M         37
artist         F         30
               M         32
doctor         M         44
educator       F         39
               M         43
engineer       F         30
               M         37
entertainment  F         31
               M         29
executive      F         44
               M         38
healthcare     F         40
               M         45
homemaker      F         34
               M         23
lawyer         F         40
               M         36
librarian      F         40
               M         40
marketing      F         37
               M         38
none           F         36
               M         19
other          F         35
               M         34
programmer     F         32
               M         33
retired        F         70
               M         63
salesman       F         27
               M         39
scientist      F         28
               M         36
student        F         21
               M         23
technician     F         38
               M         33
writer         F         38
               M         35
Name: age, dtype: int64

In [16]:
users.groupby(['occupation', 'gender'])['age'].agg(['mean']).apply(lambda x: round(x))

                      mean
occupation    gender
administrator F       41.0
              M       37.0
artist        F       30.0
              M       32.0
doctor        M       44.0
educator      F       39.0
              M       43.0
engineer      F       30.0
              M       37.0
entertainment F       31.0
              M       29.0
executive     F       44.0
              M       38.0
healthcare    F       40.0
              M       45.0
homemaker     F       34.0
              M       23.0
lawyer        F       40.0
              M       36.0
librarian     F       40.0
              M       40.0
marketing     F       37.0
              M       38.0
none          F       36.0
              M       19.0
other         F       35.0
              M       34.0
programmer    F       32.0
              M       33.0
retired       F       70.0
              M       63.0
salesman      F       27.0
              M       39.0
scientist     F       28.0
              M       36.0
student       F       21.0
              M       23.0
technician    F       38.0
              M       33.0
writer        F       38.0
              M       35.0

### Step 8.  For each occupation present the percentage of women and men

In [71]:
byoccup_gender = users.groupby(['occupation','gender'])
occup_gender_count = byoccup_gender.agg(count=pd.NamedAgg(aggfunc='count',column='gender'))

occup_count = users.groupby('occupation').agg(count=pd.NamedAgg(aggfunc='count',column='gender'))

gender_freq = occup_gender_count.div(occup_count, level='occupation')*100
display(gender_freq)

                           count
occupation    gender
administrator F        45.569620
              M        54.430380
artist        F        46.428571
              M        53.571429
doctor        M       100.000000
educator      F        27.368421
              M        72.631579
engineer      F         2.985075
              M        97.014925
entertainment F        11.111111
              M        88.888889
executive     F         9.375000
              M        90.625000
healthcare    F        68.750000
              M        31.250000
homemaker     F        85.714286
              M        14.285714
lawyer        F        16.666667
              M        83.333333
librarian     F        56.862745
              M        43.137255
marketing     F        38.461538
              M        61.538462
none          F        44.444444
              M        55.555556
other         F        34.285714
              M        65.714286
programmer    F         9.090909
              M        90.909091
retired       F         7.142857
              M        92.857143
salesman      F        25.000000
              M        75.000000
scientist     F         9.677419
              M        90.322581
student       F        30.612245
              M        69.387755
technician    F         3.703704
              M        96.296296
writer        F        42.222222
              M        57.777778

In [7]:
#messier way
male_percentages = users.groupby(['occupation', 'gender']).count().groupby('occupation').apply(lambda x: x.iloc[0]/(x.iloc[0] + x.iloc[1]) if len(x) > 1 else x.iloc[0]/x.iloc[0])['age'].rename('male_freq').sort_values(ascending=False)*100
female_percentages = (100 - male_percentages).rename('female_freq')
pd.concat([male_percentages, female_percentages],axis=1)

                male_freq  female_freq
occupation
doctor         100.000000     0.000000
homemaker       85.714286    14.285714
healthcare      68.750000    31.250000
librarian       56.862745    43.137255
artist          46.428571    53.571429
administrator   45.569620    54.430380
none            44.444444    55.555556
writer          42.222222    57.777778
marketing       38.461538    61.538462
other           34.285714    65.714286
student         30.612245    69.387755
educator        27.368421    72.631579
salesman        25.000000    75.000000
lawyer          16.666667    83.333333
entertainment   11.111111    88.888889
scientist        9.677419    90.322581
executive        9.375000    90.625000
programmer       9.090909    90.909091
retired          7.142857    92.857143
technician       3.703704    96.296296
engineer         2.985075    97.014925